yzhkj/my-code/stm32的项目程序/wifi点火模块/WIFI_FIRE_/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART3_UART_Init();

  /* USER CODE BEGIN 2 */
  HAL_GPIO_WritePin(AH1_GPIO_Port,AH1_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(AH2_GPIO_Port,AH2_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(AH3_GPIO_Port,AH3_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(AH4_GPIO_Port,AH4_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(AH5_GPIO_Port,AH5_Pin,GPIO_PIN_RESET);
  HAL_GPIO_WritePin(AH6_GPIO_Port,AH6_Pin,GPIO_PIN_RESET);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
	HAL_GPIO_WritePin(AH1_GPIO_Port,AH1_Pin,GPIO_PIN_SET);
	HAL_GPIO_TogglePin(LED1_GPIO_Port,LED1_Pin);
	HAL_Delay(1500);
	HAL_GPIO_WritePin(AH2_GPIO_Port,AH2_Pin,GPIO_PIN_SET);
    HAL_GPIO_TogglePin(LED2_GPIO_Port,LED2_Pin);	  
	HAL_Delay(1500);
	HAL_GPIO_WritePin(AH3_GPIO_Port,AH3_Pin,GPIO_PIN_SET); 
	HAL_GPIO_TogglePin(LED3_GPIO_Port,LED3_Pin);
	HAL_Delay(1500);
	HAL_GPIO_WritePin(AH4_GPIO_Port,AH4_Pin,GPIO_PIN_SET);
    HAL_GPIO_TogglePin(LED2_GPIO_Port,LED2_Pin);	  
	HAL_Delay(1500);
	HAL_GPIO_WritePin(AH5_GPIO_Port,AH5_Pin,GPIO_PIN_SET); 
	HAL_GPIO_TogglePin(LED3_GPIO_Port,LED3_Pin);
	HAL_Delay(1500);	
	HAL_GPIO_WritePin(AH6_GPIO_Port,AH6_Pin,GPIO_PIN_SET); 
	HAL_GPIO_TogglePin(LED3_GPIO_Port,LED3_Pin);
	HAL_Delay(1500);	
	HAL_GPIO_WritePin(AH7_GPIO_Port,AH7_Pin,GPIO_PIN_SET); 
	HAL_GPIO_TogglePin(LED3_GPIO_Port,LED3_Pin);
	HAL_Delay(1500);	
	
	HAL_Delay(1500);
	HAL_Delay(1500);
	HAL_Delay(1500);
	HAL_Delay(1500);
	
	HAL_GPIO_WritePin(AH1_GPIO_Port,AH1_Pin,GPIO_PIN_RESET);
	HAL_GPIO_TogglePin(LED1_GPIO_Port,LED1_Pin);
	HAL_Delay(1500);
	HAL_GPIO_WritePin(AH2_GPIO_Port,AH2_Pin,GPIO_PIN_RESET);
    HAL_GPIO_TogglePin(LED2_GPIO_Port,LED2_Pin);	  
	HAL_Delay(1500);
	HAL_GPIO_WritePin(AH3_GPIO_Port,AH3_Pin,GPIO_PIN_RESET); 
	HAL_GPIO_TogglePin(LED3_GPIO_Port,LED3_Pin);
	HAL_Delay(1500);	  
	HAL_GPIO_WritePin(AH4_GPIO_Port,AH4_Pin,GPIO_PIN_RESET);
    HAL_GPIO_TogglePin(LED2_GPIO_Port,LED2_Pin);	  
	HAL_Delay(1500);
	HAL_GPIO_WritePin(AH5_GPIO_Port,AH5_Pin,GPIO_PIN_RESET); 
	HAL_GPIO_TogglePin(LED3_GPIO_Port,LED3_Pin);
	HAL_Delay(1500);	
	HAL_GPIO_WritePin(AH6_GPIO_Port,AH6_Pin,GPIO_PIN_RESET); 
	HAL_GPIO_TogglePin(LED3_GPIO_Port,LED3_Pin);
	HAL_Delay(1500);	  
	HAL_GPIO_WritePin(AH7_GPIO_Port,AH7_Pin,GPIO_PIN_RESET); 
	HAL_GPIO_TogglePin(LED3_GPIO_Port,LED3_Pin);
	HAL_Delay(1500);
//	HAL_GPIO_TogglePin(AH1_GPIO_Port,AH1_Pin);
//	HAL_Delay(1000);
//	HAL_GPIO_TogglePin(AH2_GPIO_Port,AH2_Pin);
//	HAL_Delay(1000);
//	HAL_GPIO_TogglePin(AH3_GPIO_Port,AH3_Pin);
//	HAL_Delay(1000);
//	HAL_GPIO_TogglePin(AH4_GPIO_Port,AH4_Pin);
//	HAL_Delay(1000);
//	HAL_GPIO_TogglePin(AH5_GPIO_Port,AH5_Pin);
//	HAL_Delay(1000);
//	HAL_GPIO_TogglePin(AH6_GPIO_Port,AH6_Pin);
//	HAL_Delay(1000);
  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI_DIV2;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL16;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
